# Classes

In [6]:
import pandas as pd
import numpy as np
import sqlalchemy as sql
import requests

In [7]:
engine = sql.create_engine('mysql+mysqlconnector://tom:123@192.168.1.74:3306/trades')

In [8]:
query = 'SELECT COUNT(*) FROM xrp_trades'

In [ ]:
query_where = '''

                             SELECT case when created_at like '%-07:00' then left(created_at, 19) end as 'date',
                             price
                             FROM btc_trades 
                             LIMIT 0, 
                             


'''

In [9]:
test = pd.read_sql(query,engine)

In [19]:
x=test.to_dict()['COUNT(*)'][0]

In [23]:
x

567240

In [24]:
y = x/4

In [42]:
y*3

425430.0

In [43]:
query_part = 'SELECT created_at, price FROM btc_trades LIMIT 283620,425430'

In [44]:
test_part = pd.read_sql(query_part,engine)

In [45]:
test_part.to_csv('files/xrp_partition1.csv', index=False)

In [46]:
test_part.head()

                  created_at     price
0        2021-01-04 14:23:55  634514.0
1        2021-01-04 14:32:01  634514.0
2        2021-01-04 14:32:02  634514.0
3        2021-01-04 14:32:03  634514.0
4  2021-01-21 13:25:22-08:00  634514.0

In [47]:
test_part.tail()

                       created_at     price
425425  2021-02-28 20:18:45-08:00  968983.0
425426  2021-02-23 11:05:03-08:00  968983.0
425427  2021-02-23 11:05:04-08:00  968983.0
425428  2021-02-23 11:04:56-08:00  968984.0
425429  2021-02-23 11:04:58-08:00  968984.0

In [20]:
test.to_csv('files/test.csv',index=False)

# We need a class that process the request

In [ ]:
class req:
    def __init__(self,book):
        self.book = book
    def data(self):
        import requests
        return requests.get('https://api.bitso.com/v3/trades/?book='+self.book)

In [ ]:
def place():
    from sqlalchemy import create_engine
    import sqlite3
    coins = ['btc','eth','ltc']
    for coin in coins:
        bitcoin = req(coin+'_mxn')
        dat = bitcoin.data().json()['payload'] # Filter to only 'payload' data.
        print(dat) 
place()

In [ ]:
import sqlite3
con = sqlite3.connect('mydata.sqlite')

In [ ]:
con

In [ ]:
query = 'show tables;'

In [ ]:
con.execute(query)